Table of Contents
 Class ConcreteCheckResult
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
Concrete Check results
public class ConcreteCheckResult
Inheritance
object
ConcreteCheckResult
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ConcreteCheckResult()
Constructor
public ConcreteCheckResult()
Properties
 CheckResults
All results - first is extreme
public List<ConcreteCheckResultBase> CheckResults { get; set; }
Property Value
List<ConcreteCheckResultBase>
 ResultType
Check result type
public CheckResultType ResultType { get; set; }
Property Value
CheckResultType
 Edit this page